АлогистикТест2/src/Documents/алк_РеализацияПродукцииЭкспорт/алк_РеализацияПродукцииЭкспорт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_РеализацияПродукцииЭкспорт</name>
  <basedOn>Document.алк_ТранспортировочныеПартии</basedOn>
  <registerRecords>AccumulationRegister.алк_ВыполнениеЗаказовЭтапыСерии</registerRecords>
  <registerRecords>InformationRegister.СерийныеНомераГарантии</registerRecords>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.алк_ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.алк_ТранспортировочныеПартии</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоФактическимПогрузкам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Продавец</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПакетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемТаможня</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСостав</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесНетто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесБрутто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОГ_ИД</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АГ_ИД</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТоварыАссортиментныеГруппы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеАГ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>750</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АГ_ИД</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТоварыОбъемныеГруппы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеОГ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>750</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеСорта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОГ_ИД</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Documents/алк_РеализацияПродукцииЭкспорт/Forms/ФормаДокумента/Module.bsl
#Область ОбработкаСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюПечать);
	// Конец СтандартныеПодсистемы.Печать
	УправлениеНебольшойФирмойСервер.УстановитьОтображаниеПодменюПечати(Элементы.ПодменюПечать);	
	
КонецПроцедуры


#КонецОбласти 


#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ЗапасыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыОбъемныеГруппыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыОбъемныеГруппыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти 


#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
	// УНФ
	СтатистикаИспользованияФормКлиент.ДобавитьСтатистикуКомандПечати(ЭтотОбъект, Команда);
	// Конец УНФ
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать


#КонецОбласти 


#Область ОбработкаКоманд

&НаКлиенте
Процедура ЗаполнитьПоОснованию(Команда)
	
	ЗаполнитьПоДокументуОснованию();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЦены(Команда)
	ЗаполнитьЦеныНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЦеныНаСервере()
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	тчЗапасы.Номенклатура,
	//	|	тчЗапасы.Характеристика,
	//	|	тчЗапасы.Заказ,
	//	|	тчЗапасы.Организация
	//	|ПОМЕСТИТЬ втЗапасы
	//	|ИЗ
	//	|	&тчЗапасы КАК тчЗапасы
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	алк_ЦеныПродукцииСрезПоследних.Организация,
	//	|	алк_ЦеныПродукцииСрезПоследних.Заказ,
	//	|	алк_ЦеныПродукцииСрезПоследних.Номенклатура,
	//	|	алк_ЦеныПродукцииСрезПоследних.Характеристика,
	//	|	алк_ЦеныПродукцииСрезПоследних.Цена
	//	|ПОМЕСТИТЬ втЦены
	//	|ИЗ
	//	|	РегистрСведений.алк_ЦеныПродукции.СрезПоследних КАК алк_ЦеныПродукцииСрезПоследних
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	втЗапасы.Номенклатура,
	//	|	втЗапасы.Характеристика,
	//	|	втЗапасы.Заказ,
	//	|	втЗапасы.Организация,
	//	|	втЦены.Цена
	//	|ИЗ
	//	|	втЗапасы КАК втЗапасы
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ втЦены КАК втЦены
	//	|		ПО втЗапасы.Номенклатура = втЦены.Номенклатура
	//	|			И втЗапасы.Характеристика = втЦены.Характеристика
	//	|			И втЗапасы.Заказ = втЦены.Заказ
	//	|			И втЗапасы.Организация = втЦены.Организация";
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
	//КонецЦикла;
	
	Для каждого стрЗапасы Из Объект.Запасы Цикл
		
		ЦенаПредставление = РфпПолучениеДанныхСервер.ПолучитьЦенуСПредставлениемПоЗаказу(Объект.Организация, Объект.Заказ, стрЗапасы.Номенклатура, стрЗапасы.Характеристика);
		
		стрЗапасы.Цена = ЦенаПредставление.Цена;		
		стрЗапасы.Сумма = стрЗапасы.Цена * стрЗапасы.Объем;
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоСпецификацииНаСервере(Группа)
	
	тзТовары = Объект.Запасы.Выгрузить();
	
	Если Группа = "АГ" Тогда
		тзТовары.Свернуть("Номенклатура, АГ_ИД, Цена", "Объем");
	Иначе
		тзТовары.Свернуть("Номенклатура, ОГ_ИД, Цена", "Объем");
	КонецЕсли; 
	
	КЧ = Новый КвалификаторыЧисла(15,2);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Число"));
	ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , ,КЧ);
	
	тзТовары.Колонки.Добавить("Сумма", ОписаниеТиповЧ);
	
	Для каждого стрТовар Из тзТовары Цикл
		
		стрТовар.Сумма = стрТовар.Объем * стрТовар.Цена;
		
	КонецЦикла; 
	
	Если Группа = "АГ" Тогда
		
		тзТовары.Свернуть("Номенклатура, Цена, АГ_ИД","Объем, Сумма");
		
		Объект.ТоварыАссортиментныеГруппы.Загрузить(тзТовары);
		
		Для каждого стрГруппы Из Объект.ТоварыАссортиментныеГруппы Цикл
			стрГруппы.ПредставлениеАГ = РфпПолучениеДанныхСервер.ПредставлениеАссортиментнойГруппы(Объект.Заказ, стрГруппы.АГ_ИД);	
		КонецЦикла;	
		
	Иначе
		Объект.ТоварыОбъемныеГруппы.Загрузить(тзТовары);
		Для каждого стрГруппы Из Объект.ТоварыОбъемныеГруппы Цикл
			
			СтруктураПредставления = РфпПолучениеДанныхСервер.ПредставлениеОбъемнойГруппы(Объект.Заказ, стрГруппы.ОГ_ИД);
			
			стрГруппы.ПредставлениеОГ    = СтруктураПредставления.ПредставлениеГруппы;
			стрГруппы.ПредставлениеСорта = СтруктураПредставления.ПредставлениеСорта;
			
		КонецЦикла; 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТоварыАГПоСпецификации(Команда)
	
	ПараметрыОтбора = Новый Структура("Цена", 0); 	
	МассивСтрок = Объект.Запасы.НайтиСтроки(ПараметрыОтбора);
	
	Если МассивСтрок.Количество() <> 0 Тогда
		
		ТекстВопроса = "В спецификации есть строки с НУЛЕВОЙ ценой. (" + МассивСтрок.Количество() + ")" + Символы.ПС +
		"Продолжить выполнение операции?";
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьТоварыАГЗавершение", ЭтотОбъект);
		
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ЗаполнитьПоСпецификацииНаСервере("АГ");
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТоварыОГПоСпецификации(Команда)
	
	ПараметрыОтбора = Новый Структура("Цена", 0); 	
	МассивСтрок = Объект.Запасы.НайтиСтроки(ПараметрыОтбора);
	
	Если МассивСтрок.Количество() <> 0 Тогда
		
		ТекстВопроса = "В спецификации есть строки с НУЛЕВОЙ ценой. (" + МассивСтрок.Количество() + ")" + Символы.ПС +
		"Продолжить выполнение операции?";
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьТоварыОГЗавершение", ЭтотОбъект);
		
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ЗаполнитьПоСпецификацииНаСервере("ОГ");
		
	КонецЕсли; 
	
КонецПроцедуры


#КонецОбласти 


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьПоДокументуОснованию()
	
	Если НЕ ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ТекстВопроса = НСтр("ru = 'Документ будет полностью перезаполнен по ""Основанию"".
	|Продолжить выполнение операции?'");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьПоДокументуОснованиюЗавершение", ЭтотОбъект);
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры // ЗаполнитьПоДокументуОснованию()

&НаСервере
Процедура ЗаполнитьПоДокументу()
	
	Документ = РеквизитФормыВЗначение("Объект");
	Документ.Заполнить(Новый Структура("ЗаполнитьПоДокументамОснованиям", Истина));
	ЗначениеВРеквизитФормы(Документ, "Объект");
	Модифицированность = Истина;
	
КонецПроцедуры // ЗаполнитьПоДокументу()

#КонецОбласти


#Область ОбработчикиРезультатовИнтерактивныхДействий

&НаКлиенте
Процедура ЗаполнитьПоДокументуОснованиюЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = КодВозвратаДиалога.Да Тогда
		
		ЗаполнитьПоДокументу();
		
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьПоДокументуОснованиюЗавершение()

&НаКлиенте
Процедура ЗаполнитьТоварыАГЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = КодВозвратаДиалога.Нет Тогда
		
		Возврат;
		
	Иначе
		
		ЗаполнитьПоСпецификацииНаСервере("АГ");
		
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьТоварыАГЗавершение()

&НаКлиенте
Процедура ЗаполнитьТоварыОГЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = КодВозвратаДиалога.Нет Тогда
		
		Возврат;
		
	Иначе
		
		ЗаполнитьПоСпецификацииНаСервере("ОГ");
		
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьТоварыОГЗавершение()

#КонецОбласти


Процедура Конец()	
КонецПроцедуры
